# Session 18

## Task 1


**How to sort dataframe by index and how to sort dataframe by specific column ..**

### Sort by index

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([1, 2, 3, 4, 5], index=[100, 29, 234, 1, 150],
                  columns=['A'])

In [4]:
df

     A
100  1
29   2
234  3
1    4
150  5

In [3]:
df.sort_index()

     A
1    4
29   2
100  1
150  5
234  3

In [5]:
df.sort_index(ascending=False)

     A
234  3
150  5
100  1
29   2
1    4

### Sort by specific column

In [6]:
df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
})

In [7]:
df

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [10]:
df.sort_values(by=['col1']) #Sort by col1

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [11]:
df.sort_values(by=['col1', 'col2']) #Sort by multiple columns

  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [13]:
df.sort_values(by='col1', ascending=False) #Sort Descending

  col1  col2  col3 col4
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B
3  NaN     8     4    D

In [15]:
df.sort_values(by='col1', ascending=False, na_position='first')  #Putting NAs first

  col1  col2  col3 col4
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B